wegam/STM32F1xWorkSpace/Examples/HC/PC004V21.C
		USART_DMAPrintf	(USART1,"CH1:%0.8X\r\nCH2:%0.8X\r\n",AD1,AD2);					//自定义printf串口DMA发送程序,后边的省略号就是可变参数
	}
#endif
	
	SYSTime++;
	//锁接口LED指示灯
	{
		if(SYSTime%1000<50)
		{
			PB0	=	1;
		}
		else
		{
			PB0	=	0;
		}
	}
	
//	if(RxData>=250)
//	{
//		RxData=0;
//	}
//	status	=	RS485_ReadBufferIDLE(&RS485B,RS485RvB);	//串口空闲模式读串口接收缓冲区，如果有数据，将数据拷贝到RevBuffer,并返回接收到的数据个数，然后重新将接收缓冲区地址指向RxdBuffer
//	if(status)
//	{
//		RxData+=1;
//	}
//	if(SYSTime	==500)
//	{
//		SYSTime	=	0;
//		RxData+=1;
//		RS485_DMASend(&RS485B,&RxData,1);	//RS485-DMA发送程序
//		SysTick_DeleymS(5);				//SysTick延时nmS
//		return;
//	}
	
	SwitchID=PC004V21_GetSwitchID();	//获取当前设备ID//机柜号
	NumW=((SwitchID>>4)&0x0F)|(SwitchID<<1&0x10);			//MS拨码为槽号（HSH,右边最低位）
	NumF=SwitchID&0x07;														//发药数量--LS拨码为发药数量（HSL拨码)
//	SwitchIDBAC=0xFF;								//ID备份---ID变化时更新
	if(SwitchIDBAC!=SwitchID)
	{		
		SwitchIDBAC=SwitchID;		//更新备份
		PC004V10_TBuffer[0]=0x00;		//0xFF,NumW,NumF
		PC004V10_TBuffer[1]=0xFF;		//0xFF,NumW,NumF
		PC004V10_TBuffer[2]=NumW;		//0xFF,NumW,NumF
		PC004V10_TBuffer[3]=NumF;		//0xFF,NumW,NumF
		RS485_DMASend	(&RS485B,PC004V10_TBuffer,4);	//RS485-DMA发送程序
//		RS485_DMAPrintf(&RS485_Conf,"请求更新，发药槽号:%d,发药数量：%d",NumW,NumF);					//自定义printf串口DMA发送程序,后边的省略号就是可变参数
	}
	if(SYSTime	==500)
	{
		RS485_DMASend(&RS485B,PC004V10_TBuffer,11);	//RS485-DMA发送程序		
	}
	else
	{
		RS485_ReadBufferIDLE			(&RS485B,RS485RvB);	//串口空闲模式读串口接收缓冲区，如果有数据，将数据拷贝到RevBuffer,并返回接收到的数据个数，然后重新将接收缓冲区地址指向RxdBuffer
	}
//	return;
	if(SYSTime>=1000)
	{
		SYSTime=0;
		num++;
		if(num>5)
		{
			num=0;
//			RS485_DMASend(&RS485_Conf,(u32*)PC004V10_TBuffer,11);	//RS485-DMA发送程序
		}
//		GPIO_Toggle	(GPIOB,GPIO_Pin_0);		//将GPIO相应管脚输出翻转----V20170605//锁接口
//		TxMessage.Data[3]=num;
//		PC004V10_CAN_COMMAD();					//CAN发送命令函数，地址，命令类型，数据--时间同步--发送获取D命令
//		PC004V10_Num[0]=num;
//		CAN_StdTX_DATA(0X15,1,PC004V10_Num);			//CAN使用标准帧发送数据
//		CAN_ExtTX_DATA(0X15,1,PC004V10_Num);			//CAN使用扩展帧发送数据
	}
	if(PB1in)		//无按键
	{	
		if(KeyTime>=10&&KeyTime<3000)	//短按键
		{			
			if(PB1Flg==0)
					PB1Flg=1;
		}
		else if(KeyTime>=3000)	//长按
		{
			if(PB1Flg==0)
					PB1Flg=2;
		}
		KeyTime=0;
	}
	else
	{		
		if(KeyTime<=5000)
		{
			KeyTime++;
		}
	}
	if(PB1Flg==2)	//长按
	{
		PC004V10_CANBuffer[0]=0x01;		//命令:0x01查询槽位信息，0x02发药命令
		
		PC004V10_TBuffer[0]=0x01;
		
		RS485_DMASend(&RS485B,PC004V10_TBuffer,1);	//RS485-DMA发送程序
		CAN_StdTX_DATA(0x01,0x08,PC004V10_CANBuffer);			//CAN使用标准帧发送数据
		
		PB1Flg=0;
	}
	if(PB1Flg==1)
	{		
//		PC004V21_KEYData();		//按键发药处理函数
		PC004V10_CANBuffer[0]=0x02;		//命令:0x01查询槽位信息，0x02发药命令
		PC004V10_CANBuffer[1]=NumW;		//槽号
		PC004V10_CANBuffer[2]=NumF;		//数量
		
		PC004V10_TBuffer[0]=0x02;
		PC004V10_TBuffer[1]=NumW;
		PC004V10_TBuffer[2]=NumF;
		RS485_DMASend(&RS485B,PC004V10_TBuffer,3);	//RS485-DMA发送程序
//		RS485_DMAPrintf(&RS485B,"%d,%d",NumW,NumF);					//自定义printf串口DMA发送程序,后边的省略号就是可变参数
		CAN_StdTX_DATA(0x01,0x08,PC004V10_CANBuffer);			//CAN使用标准帧发送数据
		if(PW1Flg==0)
		{
			PW1Flg=1;
			PB1Flg=0;				
//			PWM_OUT(TIM3,PWM_OUTChannel3,0.5,10);						//PWM设定-20161127版本
		}
		else
		{
			PW1Flg=0;
			PB1Flg=0;
//			PWM_OUT(TIM3,PWM_OUTChannel3,5,500);						//PWM设定-20161127版本
		}
	}
	if(CAN_RX_DATA(&RxMessage))
	{
		if(RxMessage.Data[0]==0x81)
		{
			PC004V10_TBuffer[0]=RxMessage.Data[0];	//返回代码类型
			PC004V10_TBuffer[1]=RxMessage.Data[1];
			PC004V10_TBuffer[2]=RxMessage.Data[2];
			PC004V10_TBuffer[3]=RxMessage.Data[3];	
			PC004V10_TBuffer[4]=RxMessage.Data[4];	
			PC004V10_TBuffer[5]=RxMessage.Data[5];	//错误类型
			RS485_DMASend(&RS485B,PC004V10_TBuffer,6);	//RS485-DMA发送程序
			
		}
		if(RxMessage.StdId==0x01)
		{
			PC004V10_TBuffer[0]=RxMessage.Data[0];	//返回代码类型
			PC004V10_TBuffer[1]=RxMessage.Data[1];
			PC004V10_TBuffer[2]=RxMessage.Data[2];
			PC004V10_TBuffer[3]=RxMessage.Data[3];	//错误类型
			RS485_DMASend(&RS485B,PC004V10_TBuffer,4);	//RS485-DMA发送程序
		}
	}
	//**************检查通讯标志位，查看是否为通讯中断，如果是，则此次时间增量无效
//	status=PC004V10_485_TR();				//485收发程序//通讯接口
//	if(status&&(SYSTime>0))
//		SYSTime--;	
	
	
//	
//	//**************检测设备ID有无变化，有就更新
//	if(SYSTime%500==0)
//	{
//		if(SwitchID!=PC004V21_GetSwitchID())
//		{
//			SwitchID=PC004V21_GetSwitchID();
//			PC004V10_Buffer[5]=0x01;							//获取ID指令0x01
//			PC004V10_CAN_COMMAD();					//CAN发送命令函数，地址，命令类型，数据--时间同步--发送获取D命令
//		}
//	}
//	if(SwitchID==0)
//	{
//		Self_Test(SYSTime);
//	}
//	PC004V10_CAN_RX();									//主要接收数码管板地址，
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: 命令：0x11发药，0x12盘点，0x13加药,0x14
* 返回值			: void
*******************************************************************************/
void PD003V11FUN(void)		//智能药盒测试
{
	u16 len	=	0;
	static u8 BOXID[6]={0};	//电子标签
	static u8 serail=1;			//流水号
	if(serail>=0xFE)
		serail	=	1;
	len	=	USART_ReadBufferIDLE(USART1,USART1Rxd);	//串口空闲模式读串口接收缓冲区，如果有数据，将数据拷贝到RevBuffer,并返回接收到的数据个数，然后重新将接收缓冲区地址指向RxdBuffer
	if(len)
	{
		//===测试药盒ID号
		if(BOXID[0]	==	0x00)
		{
			BOXID[0]	=	0x9E;
			BOXID[1]	=	0xB1;
			BOXID[2]	=	0x18;
			BOXID[3]	=	0x19;
			BOXID[4]	=	0x00;
			BOXID[5]	=	0x00;
		}
		if((USART1Rxd[0]==0x11)||(USART1Rxd[0]==0x12)||(USART1Rxd[0]==0x13)||(USART1Rxd[0]==0x14))
		{
			RS485Txd[0]	=	0xFA;
			RS485Txd[1]	=	0xF5;
			RS485Txd[2]	=	serail++;	//流水号
			memcpy(&RS485Txd[3],BOXID,6);	//电子标签
			RS485Txd[9]	=	0x00;	//软件自定义
			RS485Txd[10]	=	0x00;	//软件自定义
			RS485Txd[11]	=	USART1Rxd[0];	//命令类型
			RS485Txd[12]	=	0x01;	//物理盘点此位必须是0x01
			RS485Txd[13]	=	0x01;	//1-6，该位对应某个位置药盒执行指令
			RS485Txd[14]	=	0x00;	//运行状态位
			RS485Txd[15]	=	0x00;	//错误状态
			RS485Txd[16]	=	BCC8(&RS485Txd[3],13);	//校验
		}
		RS485_DMASend(&RS485B,RS485Txd,17);					//RS485-DMA发送程序
	}
	len	=	RS485_ReadBufferIDLE(&RS485B,RS485RvB);	//串口空闲模式读串口接收缓冲区，如果有数据，将数据拷贝到RevBuffer,并返回接收到的数据个数，然后重新将接收缓冲区地址指向RxdBuffer
	if(len)
	{
		//接收到药盒应答消息
		if(RS485RvB[14]	==	0x0A)
		{
			USART_DMAPrintf(USART1,"智能药盒应答\r\n");
//			USART_DMASend(USART1,RS485RvB,len);		//串口DMA发送程序
			memset(RS485RvB,0x00,17);
			return;
		}
//		USART_DMASend(USART1,RS485RvB,len);		//串口DMA发送程序
		//应答药盒
		SysTick_DeleymS(10);				//SysTick延时nmS
		memcpy(RS485Txd,RS485RvB,len);
		RS485Txd[14]	=	0X0B;			//应答位
		RS485Txd[16]	=	BCC8(&RS485Txd[3],13);			//校验位
		RS485_DMASend(&RS485B,RS485Txd,len);				//RS485-DMA发送程序
		if(RS485RvB[11]	==	0x14)
		{
			memcpy(BOXID,&RS485RvB[3],6);
			USART_DMAPrintf(USART1,"接收到电子标签：%0.2X %0.2X %0.2X %0.2X %0.2X %0.2X\r\n",BOXID[0],BOXID[1],BOXID[2],BOXID[3],BOXID[4],BOXID[5],BOXID[6]);					//自定义printf串口DMA发送程序,后边的省略号就是可变参数
			return;
		}
		switch(RS485RvB[15])
		{
			case	0xE0:USART_DMAPrintf(USART1,"智能药盒超时未取\r\n");
						break;
			case	0xE1:USART_DMAPrintf(USART1,"ID不能读取\r\n");
						break;
			case	0xE2:USART_DMAPrintf(USART1,"智能药盒盒内药量不足，不满足发药数\r\n");
						break;
			case	0xE3:USART_DMAPrintf(USART1,"智能药盒发药数是0或者超过72，属于发药数量越界\r\n");
						break;
			case	0xE4:USART_DMAPrintf(USART1,"智能药盒动作盘点计算数据不是0-72，明显错误\r\n");
						break;
			case	0xE5:USART_DMAPrintf(USART1,"药盒电子标签信息和存取记录不匹配\r\n");
						break;
			case	0xE6:USART_DMAPrintf(USART1,"智能药盒位置位不是1-6\r\n");
						break;
			case	0xE7:USART_DMAPrintf(USART1,"智能药盒异常拔出收回\r\n");
						break;
			case	0xE8:USART_DMAPrintf(USART1,"智能药盒异常拔出\r\n");
						break;			
			default:break;			
		}
		memset(RS485RvB,0x00,17);
		return;
	}
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
*******************************************************************************/
void PC004V21_PinSet(void)
{
	//********************RS485_CTL配置
	GPIO_Configuration_OPP50(GPIOA,GPIO_Pin_1);					//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度50MHz----V20170605
	
	GPIO_Configuration_OPP50(GPIOB,GPIO_Pin_0);					//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度50MHz----V20170605//锁接口
	
	GPIO_Configuration_INF(GPIOB,GPIO_Pin_1);						//将GPIO相应管脚配置为浮空输入模式----V20170605
	
	//********************拔码开关配置
	GPIO_Configuration_IPU(GPIOC,GPIO_Pin_0);						//将GPIO相应管脚配置为上拉输入模式----V20170605
	GPIO_Configuration_IPU(GPIOC,GPIO_Pin_1);						//将GPIO相应管脚配置为上拉输入模式----V20170605
	GPIO_Configuration_IPU(GPIOC,GPIO_Pin_2);						//将GPIO相应管脚配置为上拉输入模式----V20170605
	GPIO_Configuration_IPU(GPIOC,GPIO_Pin_3);						//将GPIO相应管脚配置为上拉输入模式----V20170605
	
	GPIO_Configuration_IPU(GPIOC,GPIO_Pin_4);						//将GPIO相应管脚配置为上拉输入模式----V20170605
	GPIO_Configuration_IPU(GPIOC,GPIO_Pin_5);						//将GPIO相应管脚配置为上拉输入模式----V20170605
	GPIO_Configuration_IPU(GPIOC,GPIO_Pin_6);						//将GPIO相应管脚配置为上拉输入模式----V20170605
	GPIO_Configuration_IPU(GPIOC,GPIO_Pin_7);						//将GPIO相应管脚配置为上拉输入模式----V20170605
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
*******************************************************************************/
void PD002V30_USART_Cofiguration(void)
{
	RS485B.USARTx=UART4;
	RS485B.RS485_CTL_PORT=GPIOC;
	RS485B.RS485_CTL_Pin=GPIO_Pin_12;
	
