wegam/STM32F1xWorkSpace/Examples/HC/PC004V21.C
	RS485A.USARTx	=	USART2;
	RS485A.RS485_CTL_PORT	=	GPIOA;
	RS485A.RS485_CTL_Pin	=	GPIO_Pin_1;
	
	RS485_DMA_ConfigurationNR	(&RS485B,19200,128);	//USART_DMA配置--查询方式，不开中断,配置完默认为接收状态
	
	USART_DMA_ConfigurationNR	(USART1,115200,128);	//USART_DMA配置--查询方式，不开中断
}
/*******************************************************************************
* 函数名			:	PC004V21_KEYData
* 功能描述		:	按键发药处理函数 
* 输入			: void
* 返回值			: void
*******************************************************************************/
void PC004V21_KEYData(void)		//按键发药处理函数
{
	unsigned char SW=PC004V21_GetSwitchID();				//获取当前设备ID//机柜号(高位当发药头号，低位当发药数量）

	
	PC004V10_TBuffer[0]=0x00;			//B0-SWITCHID
	PC004V10_TBuffer[1]=0x03;			//B1-CMD命令
//	PC004V10_TBuffer[2]=0x03;
//	PC004V10_TBuffer[3]=0x03;
//	PC004V10_TBuffer[4]=0x00;
//	PC004V10_TBuffer[5]=0x00;
//	PC004V10_TBuffer[6]=0x00;
//	PC004V10_TBuffer[7]=0x00;
//	PC004V10_TBuffer[8]=0x00;
//	PC004V10_TBuffer[9]=0x00;
	
	memset(&PC004V10_TBuffer[2],0x00,8);		//所有发药头发药数量设置为0
	
	PC004V10_TBuffer[2+(SW>>4)]=SW&0x0F;		//传入数据
	
	PC004V10_TBuffer[10]=BCC8(PC004V10_TBuffer,10);		//异或校验
	
	RS485_DMASend(&RS485B,PC004V10_TBuffer,11);	//RS485-DMA发送程序
}
/*******************************************************************************
* 函数名		:
* 功能描述	: 
* 输入			: 无
* 输出			: 无
* 返回			: 无
*******************************************************************************/
u8 PC004V10_485_TR(void)				//485收发程序//通讯接口
{
	//***********串口状态检测控制485脚为接收方式
	u16 num=0;
//	u8 temp=0;
//	num=USART_RX_FlagClear(USART2);						//清除串口DMA发送全局中断标志
	//1)**********对接收到的数据进行规格检测
	if(num)
	{	
		//1.1)**********RS485转发发送模式，防止有数据进来干扰数据
		PC004V10_RS4851_CTL(RS485TX);						//485在发送模式，不接收数据
		PC004V10_delay(2000);										//延时，使得485收发控制引脚电平正确转换
		//1.3)**********命令类信息
		if((PC004V10_Buffer[0]==0xFA)&&(PC004V10_Buffer[1]==0xF5)&&(PC004V10_Buffer[2]==0x05)&&(PC004V10_Buffer[3]==0x0A))
		{
			if(PC004V10_Buffer[5]==0x04)					//更新ID指令
			{
				memset(ID_ARR,0,sizeof(ID_ARR));		//清空地址存储空间
				memset(ON_line,0,sizeof(ON_line));	//清空地址在线标志
			}
			PC004V10_CAN_COMMAD();								//CAN发送命令函数，地址，命令类型，数据--时间同步
			PC004V10_RS4851_CTL(RS485RX);					//485转为接收模式
		}
		//1.2)**********检查数据正确性
		else if((PC004V10_Buffer[0]==0xFA)&&(PC004V10_Buffer[1]==0xF5)&&(PC004V10_Buffer[7]==SwitchID)&&((PC004V10_Buffer[4]==BCC8(&PC004V10_Buffer[7],6))))			//检测头标识、机柜号和异或校验位
		{
//			/********************************************/
//			//***************判断单元地址正确与否
			u8 temp=0;
			temp=PC004V10_Buffer[8]*10+PC004V10_Buffer[9];						//将单元地址的层号和序号合成
			//1.2.1）***************判断单元地址正确与否
			if(memchr(ID_ARR,temp,sizeof(ID_ARR)))										//单元地址正确	//判断单元地址有没存在，在数组x的前n个字节中搜索字符ch。返回值为指向s中首次出现ch的指针位置。如果ch没有在s数组中出现。返回NULL			
			{
				memcpy(PC004V10_Num,PC004V10_Buffer,13);								//复制数据						

				PC004V10_Buffer[3]|=0x80;						//修改回执位
				USART_DMASend(USART2,PC004V10_Buffer,(u32)num);		//返回回执给网关板
				
				PC004V10_CAN_TX();					//CAN发送数据，地址，命令类型，数据
			}
			else		//单元地址错误
			{
				PC004V10_Buffer[3]|=0xE0;																//修改回执位
				USART_DMASend(USART2,PC004V10_Buffer,(u32)num);		//返回回执给网关板
			}
			/**********************************************/
		}
		
		else			//接收数据无效，恢复485为接收数据状态
		{
			memset(PC004V10_Buffer,0,PC004V10_BufferSize);	//初始化缓冲
			PC004V10_RS4851_CTL(RS485RX);										//485转为接收模式			
		}
		return 1;		
	}
	//2)**********根据串口2DMA发送完成中断
//	else if(USART_TX_DMAFlagClear(USART2))
//	{
//		memset(PC004V10_Buffer,0,PC004V10_BufferSize);			//初始化缓冲		
//		return 1;
//	}
	//3)**********数据发送完成后将485控制脚拉低转为接收模式
	else	if(USART_GetFlagStatus(USART2,USART_FLAG_TC)==SET)
	{
		PC004V10_RS4851_CTL(RS485RX);
		USART_ClearFlag(USART2,USART_FLAG_TC);
		return 0;
	}
	else
	{
		return 0;
	}
}
/*******************************************************************************
* 函数名		:
* 功能描述	: 
* 输入			: 无
* 输出			: 无
* 返回			: 无
*******************************************************************************/
void PC004V10_CAN_RX(void)									//主要接收数码管板地址，
{
	u8 ID_Temp=0;
	if(SET == CAN_GetITStatus(CAN_IT_FF0))
	{
		CAN_ClearITPendingBit(CAN_IT_FF0);
	}
	else if(SET == CAN_GetITStatus(CAN_IT_FOV0))
	{
		CAN_ClearITPendingBit(CAN_IT_FOV0);
	}
	else if(SET == CAN_GetITStatus(CAN_IT_FMP0))
	{
		CAN_ClearITPendingBit(CAN_IT_FMP0);
	}
	else
	{
		CAN_Receive(CAN_FIFO0,&RxMessage);
		if(RxMessage.DLC==1&&RxMessage.Data[0]==0XAA)
		{
			ID_Temp=RxMessage.StdId;
			ID_ARR[ID_Temp/10][ID_Temp%10]=ID_Temp;
			ON_line[ID_Temp/10][ID_Temp%10]=1;
		}
	}
}
/*******************************************************************************
* 函数名		:
* 功能描述	: 
* 输入			: 无
* 输出			: 无
* 返回			: 无
*******************************************************************************/
void PC004V10_CAN_TX(void)					//CAN发送数据，地址，命令类型，数据
{
	CanTxMsg TxMessage;
	
	u8	TransmitMailbox = 0;
	u32	i;

	TxMessage.StdId=CAN_ID;					//标准帧ID
//	TxMessage.ExtId=0XFF;					//扩展帧ID
	TxMessage.RTR=CAN_RTR_DATA;			//数据帧
	TxMessage.IDE=CAN_ID_STD;				//使用标准标识符
	TxMessage.DLC=8;
	TxMessage.Data[0]=CAN_Command;	//命令类型
	TxMessage.Data[1]=Data_H;				//数据高位
	TxMessage.Data[2]=Data_L;				//数据低位
	TxMessage.Data[3]=0x03;
	TxMessage.Data[4]=0x04;
	TxMessage.Data[5]=0x05;
	TxMessage.Data[6]=0x06;
	TxMessage.Data[7]=0x07;
	TransmitMailbox = CAN_Transmit(&TxMessage);
	i = 0;
	// 用于检查消息传输是否正常
	while((CAN_TransmitStatus(TransmitMailbox) != CANTXOK) && (i != 0xFF))
	{
		i++;
	}
	i = 0;
	// 检查返回的挂号的信息数目
	while((CAN_MessagePending(CAN_FIFO0) < 1) && (i != 0xFF))
	{
		i++;
	}
}
/*******************************************************************************
* 函数名		:
* 功能描述	: 
* 输入			: 无
* 输出			: 无
* 返回			: 无
*******************************************************************************/
void PC004V10_CAN_COMMAD(void)					//CAN发送命令函数，地址，命令类型，数据--时间同步
{
//	CanTxMsg TxMessage;
	
	u8	TransmitMailbox = 0;
	u32	i;

	TxMessage.StdId=0X3FF;							//标准帧ID
	TxMessage.ExtId=0X3F5;						//扩展帧ID
	TxMessage.RTR=CAN_RTR_DATA;					//数据帧
	TxMessage.IDE=CAN_ID_EXT;						//使用扩展帧标识符
	TxMessage.DLC=4;
	TxMessage.Data[0]=PC004V10_Buffer[5];	//命令类型
	TxMessage.Data[1]=0x00;						//数据高位
	TxMessage.Data[2]=0x00;						//数据低位
//	TxMessage.Data[3]=0x00;
//	TxMessage.Data[4]=0x00;
//	TxMessage.Data[5]=0x00;
//	TxMessage.Data[6]=0x00;
//	TxMessage.Data[7]=0x00;
	TransmitMailbox = CAN_Transmit(&TxMessage);
	i = 0;
	// 用于检查消息传输是否正常
	while((CAN_TransmitStatus(TransmitMailbox) != CANTXOK) && (i != 0xFF))
	{
		i++;
	}
	i = 0;
	// 检查返回的挂号的信息数目
	while((CAN_MessagePending(CAN_FIFO0) < 1) && (i != 0xFF))
	{
		i++;
	}
	memset(PC004V10_Buffer,0,PC004V10_BufferSize);	//初始化缓冲
}

