wegam/STM32F1xWorkSpace/Examples/HC/PC004V21.C
/*******************************************************************************
*函数名		:	function
*功能描述	:	函数功能说明
*输入			: 
*输出			:	无
*返回值		:	无
*例程			:
*******************************************************************************/
u8 PC004V21_GetSwitchID(void)
{
	u8	SW_ID=0;
	//1)***************获取H拔码开关地址，从右到左为从低到高
	if(!GPIO_ReadInputDataBit(GPIOC,GPIO_Pin_4))		//SWH-1
	{
		SW_ID|=1;
	}
	SW_ID<<=1;
	if(!GPIO_ReadInputDataBit(GPIOC,GPIO_Pin_5))		//SWH-2
	{
		SW_ID|=1;
	}
	SW_ID<<=1;
	if(!GPIO_ReadInputDataBit(GPIOC,GPIO_Pin_6))		//SWH-3
	{
		SW_ID|=1;
	}
	SW_ID<<=1;
	if(!GPIO_ReadInputDataBit(GPIOC,GPIO_Pin_7))		//SWH-4
	{
		SW_ID|=1;
	}
	
	//2)***************获取L拔码开关地址，从右到左为从低到高
	SW_ID<<=1;
	if(!GPIO_ReadInputDataBit(GPIOC,GPIO_Pin_0))		//SWL-1
	{
		SW_ID|=1;
	}
	SW_ID<<=1;
	if(!GPIO_ReadInputDataBit(GPIOC,GPIO_Pin_1))		//SWL-2
	{
		SW_ID|=1;
	}
	SW_ID<<=1;
	if(!GPIO_ReadInputDataBit(GPIOC,GPIO_Pin_2))		//SWL-3
	{
		SW_ID|=1;
	}
	SW_ID<<=1;
	if(!GPIO_ReadInputDataBit(GPIOC,GPIO_Pin_3))		//SWL-4
	{
		SW_ID|=1;
	}
//	SW_ID=~SW_ID;
	//3)***************返回获取的ID值
	return (SW_ID);

}
void Self_Test(u16 time)			//拔码开关为0时，计数显示测试
{
//	//************CAN通讯数据
//#define	CAN_ID				PC004V10_Num[8]*10+PC004V10_Num[9]		//单元地址	由两位数合并，十位为层，个位为序号
//#define	CAN_Command		PC004V10_Num[5]												//命令类型----上位机用户码
//#define	Data_H				PC004V10_Num[11]											//数据高位
//#define	Data_L				PC004V10_Num[12]											//数据低位
//	Self_Dsp=0;							//拔码开关为0时，自检测试显示标识变量
	if((time%10==0)&&(Self_Dsp==0))
	{
		PC004V10_Num[5]=0x05;				//命令类型----上位机用户码
		
//		PC004V10_Num[12]++;
		if(PC004V10_Num[12]++>=99)
		{
			PC004V10_Num[12]=0;
			if(PC004V10_Num[11]++>=9)
			{
				PC004V10_Num[11]=0;
				if(PC004V10_Num[9]++>=3)
				{
					PC004V10_Num[9]=0;
					if(PC004V10_Num[8]++>=5)
					{
						PC004V10_Num[8]=1;
						PC004V10_Num[9]=0;
						PC004V10_Num[11]=0;
						PC004V10_Num[12]=0;
						Self_Dsp=1;							//拔码开关为0时，自检测试显示标识变量，1--显示ID
						SYSTime=0;
					}
				}
			}
		}		
		PC004V10_CAN_TX();					//CAN发送数据，地址，命令类型，数据
	}
	else if(Self_Dsp==1)
	{
		if(time<5)
		{
			PC004V10_Num[5]=0x04;				//命令类型----显示ID
//			PC004V10_CAN_TX();				//CAN发送数据，地址，命令类型，数据
			PC004V10_CAN_COMMAD();			//CAN发送命令函数，地址，命令类型，数据--时间同步
		}
		else if(time>=9999)
		{
			PC004V10_Num[5]=0x05;				//命令类型----上位机用户码
			PC004V10_Num[8]=1;
			PC004V10_Num[9]=0;
			PC004V10_Num[11]=0;
			PC004V10_Num[12]=0;
			PC004V10_CAN_COMMAD();			//CAN发送命令函数，地址，命令类型，数据--时间同步
			Self_Dsp=0;									//拔码开关为0时，自检测试显示标识变量，0--计数
		}
	}
}

/*******************************************************************************
* 函数名		:
* 功能描述	: 
* 输入			: 无
* 输出			: 无
* 返回			: 无
*******************************************************************************/
void PC004V10_delay(u16 time)
{
	while(time--);
}



#endif
